tap "ddev/ddev"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "ngrok/ngrok"
tap "vladkens/tap"
brew "bat", link: false
brew "python@3.12"
brew "cbonsai"
brew "php"
brew "composer"
brew "exercism"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gh"
brew "go"
brew "httpie"
brew "jq"
brew "julia"
brew "luarocks"
brew "neofetch"
brew "neovim"
brew "node"
brew "nvm"
brew "openjdk"
brew "poppler"
brew "powerlevel10k"
brew "python-setuptools"
brew "pyvim"
brew "raylib"
brew "ripgrep"
brew "socat"
brew "stow"
brew "thefuck"
brew "tmux"
brew "unar"
brew "wget"
brew "yazi", args: ["HEAD"]
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "ddev/ddev/ddev"
brew "felixkratz/formulae/borders"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "font-symbols-only-nerd-font"
cask "jordanbaird-ice"
cask "neovide"
cask "ngrok"
cask "shortcat"
cask "spaceman"
cask "stats"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "astro-build.astro-vscode"
vscode "astro-build.houston"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "chirtlelovesdolls.nebula-theme"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eliverlara.sweet-vscode-icons"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "gencer.html-slim-scss-css-class-completion"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "glenn2223.live-sass"
vscode "gruntfuggly.todo-tree"
vscode "inci-august.august-themes"
vscode "jock.svg"
vscode "josee9988.minifyall"
vscode "kokororin.vscode-phpfmt"
vscode "mhutchie.git-graph"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mutantdino.resourcemonitor"
vscode "pkief.material-icon-theme"
vscode "pucelle.vscode-css-navigation"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "seatonjiang.gitmoji-vscode"
vscode "sonarsource.sonarlint-vscode"
vscode "stivo.tailwind-fold"
vscode "syler.sass-indented"
vscode "tobermory.es6-string-html"
vscode "vintharas.learn-vim"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yatki.vscode-surround"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "ziyasal.vscode-open-in-github"
